In [1]:
#Importing python libraries

# importing pandas 
import pandas as pd

# importing numpy
import numpy as np

In [22]:
#Loading datasets
#I chose to download the files first then upload them to my notebook.
#The links to these files are are below
# CDR 20120507 [http://bit.ly/TelecomDataset1] 
# CDR 20120508 [http://bit.ly/TelecomDataset2] 
# CDR 20120509 [http://bit.ly/TelecomDataset3]

df1 = pd.read_csv('Telcom_dataset.csv')

#I used the .head() function to view the fisrt 5 rows of my dataframe 
#and .shape[0] to count the number of rows
# df1.head()
# count_row=df1.shape[0]
# count_row

# missin_vals=df1.isnull()

# missin_vals.sum()

x=df1.duplicated()
x.sum()

82

In [21]:

df2 = pd.read_csv('Telcom_dataset2.csv')

#df2.head()
# count_row=df2.shape[0]
# count_row
# missin_vals=df2.isnull()

# missin_vals.sum()

x=df2.duplicated()
x.sum()

78

In [20]:
# To load the third dataset and preview

df3 = pd.read_csv('Telcom_dataset3.csv')

# #df3.head()
# count_row=df3.shape[0]
# count_row

# missin_vals=df3.isnull()

# missin_vals.sum()

x=df3.duplicated()
x.sum()

93

In [18]:
df4 = pd.read_csv('cells_geo.csv', delimiter=';')

# #df3.head()
# count_row=df4.shape[0]
# count_row

# missin_vals=df4.isnull()

# missin_vals.sum()

x=df4.duplicated()
x.sum()

0

In [7]:
#Cleaning Datasets
#Changing columns names
# Changing the columns names
# previewing the column names
# change to lower case

df1.columns
  
df1.columns = map(str.lower, df1.columns)
df1.columns

columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number_int',
'dw_b_number_int', 'country_a', 'country_b', 'cell_id', 'site_id']

In [46]:

# changing columns titles for dataset 1
df1.columns = columns
df1.head()

  product  value              date_time  ... country_b     cell_id     site_id
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [47]:

# changing columns titles for dataset 2

df2.columns = columns
df2.head()

  product  value              date_time  ... country_b     cell_id     site_id
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [48]:

# changing columns titles for dataset 3

df3.columns = columns
df3.head()

  product  value              date_time  ... country_b     cell_id     site_id
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [49]:
#Concatenating the three dataframes
# combining the three dataframes using concatenation

df_comb = pd.concat([df1,df2,df3], axis=0, ignore_index = 1)
count_row=df_comb.shape[0]
count_row

df_comb.head()

  product  value              date_time  ... country_b     cell_id     site_id
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [62]:
#Dropping duplicates
# y=df_comb.duplicated()
# y.sum()
df_comb.drop_duplicates(inplace= True)

In [63]:
count_row=df_comb.shape[0]
count_row

14750

In [52]:
#Dropping unnecessary columns

# Dropping unnecessary columns 

df_combnew = df_comb.drop(columns = ['cell_on_site','country_a' ,	'country_b'])
df_combnew.head()

  product  value  ...     cell_id     site_id
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv

[5 rows x 7 columns]

In [53]:
#removing missing values

missing=df_combnew.isnull()
missing.sum()

product               0
value                 0
date_time             0
dw_a_number_int       0
dw_b_number_int       0
cell_id               0
site_id            1997
dtype: int64

In [56]:
#remove rows with missing value/NaN in any column

df_combnew1 = df_combnew.dropna()
df_combnew1.shape[0]

13006

In [57]:
#remove rows with missing value/NaN in any column

df4_new = df4.dropna()
df4_new.shape[0]

3880

In [58]:
# the sum for each product by billing price

le_grp = df_combnew1.groupby(['product'])['value'].sum()
le_grp

product
Voice    299693
data       2001
sms       53427
Name: value, dtype: int64

In [71]:
#most used city

cnt1=df4.groupby(['VILLES'])['STATUS'].count()
cnt1.sort_values()

VILLES
GUINKIN          0
DANANON          1
OUANGOLO         1
KOTOULA          2
MEMNI            2
              ...
TREICHVILLE    132
MARCORY        141
ABOBO          250
YOPOUGON       289
COCODY         354
Name: STATUS, Length: 504, dtype: int64

In [ ]:
# to split the date and time column into separate columns

df_combine_cleaned.head()

# create a new column and solit the date_time column into 2

df_combine_cleaned[['date', 'time']] = df_combine.date_time.str.split(expand=True)
df_combine_cleaned.head()

In [ ]:
df_combine_cleaned

In [ ]:
Use Google Colab or Jupyter Notebook for data preparation and analysis.
Import pandas and Numpy libraries for data manipulation.
Loading datasets and previewing datasets.
Cleaning data; Renaming columns for uniformity, and dropping insignificant columns.
Create a new column to separate data_time column